run/T_channel/carreau/myOhmic/constant/electricProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Website:  https://openfoam.org                  |
|   \\  /    A nd           | Version:  9                                     |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      electricProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
 
parameters
{
        type             myOhmic;      
  
        relPerm          relPerm [ 0 0 0 0 0 0 0 ] 78.3; 
        T                T [ 0 0 0 1 0 0 0 ] 300;
        psiContrib       false; 
        
        species
        (        
           cations
           {        
              z                 z [ 0 0 0 0 0 0 0 ] 1;      
              D                 D [ 0 2 -1 0 0 0 0 ] 1e-9;
              c0                c0 [ 0 -3 0 0 1 0 0 ] 1;          
           }
           
           anions
           {  
              z                 z [ 0 0 0 0 0 0 0 ] -1;         
              D                 D [ 0 2 -1 0 0 0 0 ] 1e-9;
              c0                c0 [ 0 -3 0 0 1 0 0 ] 1;         
           }
           
                           
        ); 
}

// ************************************************************************* //
