run/T_channel/carreau/myOhmic/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Website:  https://openfoam.org                  |
|   \\  /    A nd           | Version:  9                                     |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inletNorth
    {
	type             pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }
    
    inletSouth
    {
	type             pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }
    
    botwalls
    {
	type            noSlip;
        value           uniform (0 0 0);
	       
    }
    
    topwalls
    {
	type            noSlip;
        value           uniform (0 0 0);      
    }
    frontAndBack
    {
	type            empty;       
    }

    outlet
    {
	type             pressureInletOutletVelocity;
        value           uniform (0 0 0);     
    }
}
  

// ************************************************************************* //
