run/T_channel/carreau/myOhmic/0/psi
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Website:  https://openfoam.org                  |
|   \\  /    A nd           | Version:  9                                     |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      psi;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 2 -3 0 0 -1 0];

internalField   uniform 0;

boundaryField
{
    inletNorth
    {
        type            fixedValue;
        value           uniform 0;
    }
    
    inletSouth
    {
        type            fixedValue;
        value           uniform 0;
    }
    
    topwalls
    {
	type            fixedValue;
        value           uniform -0.102;       
    }
    
     botwalls
    {
	type            fixedValue;
        value           uniform -0.0525;
	       
    }
    
    
    frontAndBack
    {
	type            empty;       
    }

    outlet
    {
        type            zeroGradient;
    }
    
      
    
}

// ************************************************************************* //
