run/T_channel/carreau/myOhmic/0/sigma.org
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Website:  https://openfoam.org                  |
|   \\  /    A nd           | Version:  9                                     |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      sigma;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [-1 -3 3 0 0 2 0];

internalField   uniform 0.0038;

boundaryField
{
    inletNorth
    {
	type            fixedValue;
	value           uniform 0.0038;
    }
    
    inletSouth
    {
	type            fixedValue;
	value           uniform 0.0341;
    }
    
    
   
    botwalls
    {
	type            zeroGradient;       
    }
    
    topwalls
    {
	type            zeroGradient;       
    }
    frontAndBack
    {
	type            empty;       
    }

    outlet
    {
	type            zeroGradient;         
    }     
}

// ************************************************************************* //
